; domain
(define (domain dominio-drones-2)
  (:requirements :strips :typing :action-costs)

  (:types
    dron persona localizacion caja contenido contenedor num)

  (:predicates
    (dron-en ?d - dron ?l - localizacion)
    (caja-en ?c - caja ?l - localizacion)
    (persona-en ?p - persona ?l - localizacion)
    (en-deposito ?l - localizacion)

    (tiene ?p - persona ?t - contenido)
    (contiene ?c - caja ?t - contenido)
    (contenedor-libre ?k - contenedor) 
    
    (necesita ?p - persona ?t - contenido)

    (tiene-contenedor ?d - dron ?k - contenedor)
    (en-contenedor ?k - contenedor ?c - caja)
    (dron-libre ?d - dron)
    
    (tiene-caja ?d - dron ?c - caja)
    (caja-libre ?c - caja)
    (dron-sin-caja ?d - dron)
  
    (siguiente ?n1 - num ?n2 - num)
    (cajas-en-contenedor ?k - contenedor ?n - num)
    (cero ?n - num)
  )

  (:functions
    (fly-cost ?l1 - localizacion ?l2 - localizacion)
    (total-cost)
  )

  (:action coger
    :parameters (
      ?d - dron 
      ?k - contenedor 
      ?l - localizacion
      ?n - num
    )
    :precondition (and
      (dron-en ?d ?l)
      (en-deposito ?l)
      (dron-libre ?d)
      (contenedor-libre ?k)
      (cero ?n)
    )
    :effect (and
      (tiene-contenedor ?d ?k)
      (not (dron-libre ?d))
      (not (contenedor-libre ?k))
      (cajas-en-contenedor ?k ?n)
    )
  )
  
  (:action dejar
    :parameters (
      ?d - dron 
      ?k - contenedor 
      ?l - localizacion
      ?n - num
    )
    :precondition (and
      (dron-en ?d ?l)
      (en-deposito ?l)
      (tiene-contenedor ?d ?k)
      (cero ?n)
      (cajas-en-contenedor ?k ?n)
    )
    :effect (and
      (not (tiene-contenedor ?d ?k))
      (dron-libre ?d)
      (contenedor-libre ?k)
    )
  )
  
  (:action coger-caja
    :parameters (
      ?d - dron 
      ?c - caja 
      ?l - localizacion
    )
    :precondition (and
      (dron-en ?d ?l)
      (caja-en ?c ?l)
      (dron-sin-caja ?d)
      (caja-libre ?c)
    )
    :effect (and
      (tiene-caja ?d ?c)
      (not (dron-sin-caja ?d))
      (not (caja-libre ?c))
      (not (caja-en ?c ?l))
    )
  )


  (:action meter
    :parameters (
      ?d - dron 
      ?c - caja 
      ?k - contenedor
      ?n1 ?n2 - num
    )
    :precondition (and 
      (tiene-contenedor ?d ?k)
      (tiene-caja ?d ?c) 
      (siguiente ?n1 ?n2)
      (cajas-en-contenedor ?k ?n1)
    )
    :effect (and
      (en-contenedor ?k ?c) 
      (not (tiene-caja ?d ?c))
      (dron-sin-caja ?d) 
      (not (cajas-en-contenedor ?k ?n1))
      (cajas-en-contenedor ?k ?n2)
    )
  )
  
  (:action sacar
    :parameters (
      ?d - dron 
      ?c - caja 
      ?k - contenedor
      ?n1 ?n2 - num
    )
    :precondition (and
      (tiene-contenedor ?d ?k)
      (en-contenedor ?k ?c)
      (dron-sin-caja ?d)
      (siguiente ?n1 ?n2)
    )
    :effect (and
      (not (en-contenedor ?k ?c)) 
      (not (cajas-en-contenedor ?k ?n2))
      (cajas-en-contenedor ?k ?n1)
      (not (dron-sin-caja ?d))
      (tiene-caja ?d ?c)
    )
  )

  (:action volar
    :parameters (
      ?d - dron 
      ?from - localizacion 
      ?to - localizacion
    )
    :precondition (and
      (dron-en ?d ?from)
      (dron-sin-caja ?d)
    )
    :effect (and
      (not (dron-en ?d ?from)) 
      (dron-en ?d ?to)
      (increase (total-cost) (fly-cost ?from ?to))
    )
  )

  (:action entregar
    :parameters (
      ?d - dron 
      ?c - caja 
      ?p - persona 
      ?l - localizacion 
      ?t - contenido
    )
    :precondition (and
      (dron-en ?d ?l) 
      (tiene-caja ?d ?c)
      
      (persona-en ?p ?l)              
      (contiene ?c ?t)
      (necesita ?p ?t)
      
    )
    :effect (and
      (tiene ?p ?t)
      (not (necesita ?p ?t))
      (not (tiene-caja ?d ?c))
      (dron-sin-caja ?d)
    )
  )
)

; problem
(define (problem drone_problem_d1_l10_p10_c10_g10_ct2)
(:domain dominio-drones-2)
(:objects
	dron1 - dron
	deposito loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 - localizacion
	caja1 caja2 caja3 caja4 caja5 caja6 caja7 caja8 caja9 caja10 - caja
	comida medicina - contenido
	pers1 pers2 pers3 pers4 pers5 pers6 pers7 pers8 pers9 pers10 - persona
	k1 - contenedor
n0 n1 n2 n3 n4 - num
)
(:init
	(dron-en dron1 deposito)
	(dron-libre dron1)
	(dron-sin-caja dron1)


	(en-deposito deposito) 
	(contenedor-libre k1)

	(caja-en caja1 deposito) (caja-libre caja1)(contiene caja1 comida)
	(caja-en caja2 deposito) (caja-libre caja2)(contiene caja2 comida)
	(caja-en caja3 deposito) (caja-libre caja3)(contiene caja3 comida)
	(caja-en caja4 deposito) (caja-libre caja4)(contiene caja4 comida)

	(caja-en caja5 deposito)(caja-libre caja5)(contiene caja5 medicina)
	(caja-en caja6 deposito)(caja-libre caja6)(contiene caja6 medicina)
	(caja-en caja7 deposito)(caja-libre caja7)(contiene caja7 medicina)
	(caja-en caja8 deposito)(caja-libre caja8)(contiene caja8 medicina)
	(caja-en caja9 deposito)(caja-libre caja9)(contiene caja9 medicina)
	(caja-en caja10 deposito)(caja-libre caja10)(contiene caja10 medicina)

	(persona-en pers1 loc1)(necesita pers1 medicina)

	(persona-en pers2 loc2)(necesita pers2 medicina)

	(persona-en pers3 loc3)(necesita pers3 comida)

	(persona-en pers4 loc4)(necesita pers4 comida)
(necesita pers4 medicina)
	(persona-en pers5 loc5)(necesita pers5 comida)
(necesita pers5 medicina)
	(persona-en pers6 loc6)(necesita pers6 medicina)

	(persona-en pers7 loc7)(necesita pers7 medicina)

	(persona-en pers8 loc8)(necesita pers8 comida)

	(persona-en pers9 loc9)
	(persona-en pers10 loc10)
	(= (fly-cost deposito loc1) 21)
	(= (fly-cost deposito loc2) 13)
	(= (fly-cost deposito loc3) 36)
	(= (fly-cost deposito loc4) 45)
	(= (fly-cost deposito loc5) 25)
	(= (fly-cost deposito loc6) 33)
	(= (fly-cost deposito loc7) 44)
	(= (fly-cost deposito loc8) 36)
	(= (fly-cost deposito loc9) 36)
	(= (fly-cost deposito loc10) 35)
	(= (fly-cost loc1 deposito) 21)
	(= (fly-cost loc1 loc2) 14)
	(= (fly-cost loc1 loc3) 16)
	(= (fly-cost loc1 loc4) 25)
	(= (fly-cost loc1 loc5) 16)
	(= (fly-cost loc1 loc6) 21)
	(= (fly-cost loc1 loc7) 23)
	(= (fly-cost loc1 loc8) 20)
	(= (fly-cost loc1 loc9) 21)
	(= (fly-cost loc1 loc10) 19)
	(= (fly-cost loc2 deposito) 13)
	(= (fly-cost loc2 loc1) 14)
	(= (fly-cost loc2 loc3) 25)
	(= (fly-cost loc2 loc4) 35)
	(= (fly-cost loc2 loc5) 25)
	(= (fly-cost loc2 loc6) 32)
	(= (fly-cost loc2 loc7) 35)
	(= (fly-cost loc2 loc8) 33)
	(= (fly-cost loc2 loc9) 24)
	(= (fly-cost loc2 loc10) 23)
	(= (fly-cost loc3 deposito) 36)
	(= (fly-cost loc3 loc1) 16)
	(= (fly-cost loc3 loc2) 25)
	(= (fly-cost loc3 loc4) 11)
	(= (fly-cost loc3 loc5) 27)
	(= (fly-cost loc3 loc6) 29)
	(= (fly-cost loc3 loc7) 12)
	(= (fly-cost loc3 loc8) 23)
	(= (fly-cost loc3 loc9) 13)
	(= (fly-cost loc3 loc10) 9)
	(= (fly-cost loc4 deposito) 45)
	(= (fly-cost loc4 loc1) 25)
	(= (fly-cost loc4 loc2) 35)
	(= (fly-cost loc4 loc3) 11)
	(= (fly-cost loc4 loc5) 33)
	(= (fly-cost loc4 loc6) 33)
	(= (fly-cost loc4 loc7) 6)
	(= (fly-cost loc4 loc8) 25)
	(= (fly-cost loc4 loc9) 20)
	(= (fly-cost loc4 loc10) 17)
	(= (fly-cost loc5 deposito) 25)
	(= (fly-cost loc5 loc1) 16)
	(= (fly-cost loc5 loc2) 25)
	(= (fly-cost loc5 loc3) 27)
	(= (fly-cost loc5 loc4) 33)
	(= (fly-cost loc5 loc6) 9)
	(= (fly-cost loc5 loc7) 29)
	(= (fly-cost loc5 loc8) 13)
	(= (fly-cost loc5 loc9) 35)
	(= (fly-cost loc5 loc10) 32)
	(= (fly-cost loc6 deposito) 33)
	(= (fly-cost loc6 loc1) 21)
	(= (fly-cost loc6 loc2) 32)
	(= (fly-cost loc6 loc3) 29)
	(= (fly-cost loc6 loc4) 33)
	(= (fly-cost loc6 loc5) 9)
	(= (fly-cost loc6 loc7) 28)
	(= (fly-cost loc6 loc8) 9)
	(= (fly-cost loc6 loc9) 39)
	(= (fly-cost loc6 loc10) 36)
	(= (fly-cost loc7 deposito) 44)
	(= (fly-cost loc7 loc1) 23)
	(= (fly-cost loc7 loc2) 35)
	(= (fly-cost loc7 loc3) 12)
	(= (fly-cost loc7 loc4) 6)
	(= (fly-cost loc7 loc5) 29)
	(= (fly-cost loc7 loc6) 28)
	(= (fly-cost loc7 loc8) 20)
	(= (fly-cost loc7 loc9) 23)
	(= (fly-cost loc7 loc10) 20)
	(= (fly-cost loc8 deposito) 36)
	(= (fly-cost loc8 loc1) 20)
	(= (fly-cost loc8 loc2) 33)
	(= (fly-cost loc8 loc3) 23)
	(= (fly-cost loc8 loc4) 25)
	(= (fly-cost loc8 loc5) 13)
	(= (fly-cost loc8 loc6) 9)
	(= (fly-cost loc8 loc7) 20)
	(= (fly-cost loc8 loc9) 34)
	(= (fly-cost loc8 loc10) 31)
	(= (fly-cost loc9 deposito) 36)
	(= (fly-cost loc9 loc1) 21)
	(= (fly-cost loc9 loc2) 24)
	(= (fly-cost loc9 loc3) 13)
	(= (fly-cost loc9 loc4) 20)
	(= (fly-cost loc9 loc5) 35)
	(= (fly-cost loc9 loc6) 39)
	(= (fly-cost loc9 loc7) 23)
	(= (fly-cost loc9 loc8) 34)
	(= (fly-cost loc9 loc10) 4)
	(= (fly-cost loc10 deposito) 35)
	(= (fly-cost loc10 loc1) 19)
	(= (fly-cost loc10 loc2) 23)
	(= (fly-cost loc10 loc3) 9)
	(= (fly-cost loc10 loc4) 17)
	(= (fly-cost loc10 loc5) 32)
	(= (fly-cost loc10 loc6) 36)
	(= (fly-cost loc10 loc7) 20)
	(= (fly-cost loc10 loc8) 31)
	(= (fly-cost loc10 loc9) 4)

	(cajas-en-contenedor k1 n0)

	(cero n0) 
	(siguiente n0 n1) 
	(siguiente n1 n2) 
	(siguiente n2 n3) 
	(siguiente n3 n4)	(= (total-cost) 0)
)
(:goal (and
	(dron-en dron1 deposito)
	(tiene pers1 medicina)
	(tiene pers2 medicina)
	(tiene pers3 comida)
	(tiene pers4 comida)
	(tiene pers4 medicina)
	(tiene pers5 comida)
	(tiene pers5 medicina)
	(tiene pers6 medicina)
	(tiene pers7 medicina)
	(tiene pers8 comida)
	))
(:metric minimize (total-cost)))

; plan
1. (coger-caja dron1 caja1 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja1) (caja-en caja1 deposito)
   added: (tiene-caja dron1 caja1)
   goals met: 1 of 11
2. (coger dron1 k1 deposito n0)
   deleted: (dron-libre dron1) (contenedor-libre k1)
   added: (tiene-contenedor dron1 k1)
   goals met: 1 of 11
3. (meter dron1 caja1 k1 n0 n1)
   deleted: (tiene-caja dron1 caja1) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja1) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 1 of 11
4. (volar dron1 deposito loc3)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc3)
   goals met: 0 of 11
5. (sacar dron1 caja1 k1 n0 n1)
   deleted: (en-contenedor k1 caja1) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja1)
   goals met: 0 of 11
6. (entregar dron1 caja1 pers3 loc3 comida)
   deleted: (necesita pers3 comida) (tiene-caja dron1 caja1)
   added: (tiene pers3 comida) (dron-sin-caja dron1)
   goals met: 1 of 11
7. (volar dron1 loc3 deposito)
   deleted: (dron-en dron1 loc3)
   added: (dron-en dron1 deposito)
   goals met: 2 of 11
8. (coger-caja dron1 caja10 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja10) (caja-en caja10 deposito)
   added: (tiene-caja dron1 caja10)
   goals met: 2 of 11
9. (meter dron1 caja10 k1 n0 n1)
   deleted: (tiene-caja dron1 caja10) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja10) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 2 of 11
10. (volar dron1 deposito loc1)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc1)
   goals met: 1 of 11
11. (sacar dron1 caja10 k1 n0 n1)
   deleted: (en-contenedor k1 caja10) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja10)
   goals met: 1 of 11
12. (entregar dron1 caja10 pers1 loc1 medicina)
   deleted: (necesita pers1 medicina) (tiene-caja dron1 caja10)
   added: (tiene pers1 medicina) (dron-sin-caja dron1)
   goals met: 2 of 11
13. (volar dron1 loc1 deposito)
   deleted: (dron-en dron1 loc1)
   added: (dron-en dron1 deposito)
   goals met: 3 of 11
14. (coger-caja dron1 caja2 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja2) (caja-en caja2 deposito)
   added: (tiene-caja dron1 caja2)
   goals met: 3 of 11
15. (meter dron1 caja2 k1 n0 n1)
   deleted: (tiene-caja dron1 caja2) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja2) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 3 of 11
16. (volar dron1 deposito loc4)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc4)
   goals met: 2 of 11
17. (sacar dron1 caja2 k1 n0 n1)
   deleted: (en-contenedor k1 caja2) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja2)
   goals met: 2 of 11
18. (entregar dron1 caja2 pers4 loc4 comida)
   deleted: (necesita pers4 comida) (tiene-caja dron1 caja2)
   added: (tiene pers4 comida) (dron-sin-caja dron1)
   goals met: 3 of 11
19. (volar dron1 loc4 deposito)
   deleted: (dron-en dron1 loc4)
   added: (dron-en dron1 deposito)
   goals met: 4 of 11
20. (coger-caja dron1 caja3 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja3) (caja-en caja3 deposito)
   added: (tiene-caja dron1 caja3)
   goals met: 4 of 11
21. (meter dron1 caja3 k1 n0 n1)
   deleted: (tiene-caja dron1 caja3) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja3) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 4 of 11
22. (volar dron1 deposito loc5)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc5)
   goals met: 3 of 11
23. (sacar dron1 caja3 k1 n0 n1)
   deleted: (en-contenedor k1 caja3) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja3)
   goals met: 3 of 11
24. (entregar dron1 caja3 pers5 loc5 comida)
   deleted: (necesita pers5 comida) (tiene-caja dron1 caja3)
   added: (tiene pers5 comida) (dron-sin-caja dron1)
   goals met: 4 of 11
25. (volar dron1 loc5 deposito)
   deleted: (dron-en dron1 loc5)
   added: (dron-en dron1 deposito)
   goals met: 5 of 11
26. (coger-caja dron1 caja4 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja4) (caja-en caja4 deposito)
   added: (tiene-caja dron1 caja4)
   goals met: 5 of 11
27. (meter dron1 caja4 k1 n0 n1)
   deleted: (tiene-caja dron1 caja4) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja4) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 5 of 11
28. (volar dron1 deposito loc8)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc8)
   goals met: 4 of 11
29. (sacar dron1 caja4 k1 n0 n1)
   deleted: (en-contenedor k1 caja4) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja4)
   goals met: 4 of 11
30. (entregar dron1 caja4 pers8 loc8 comida)
   deleted: (necesita pers8 comida) (tiene-caja dron1 caja4)
   added: (tiene pers8 comida) (dron-sin-caja dron1)
   goals met: 5 of 11
31. (volar dron1 loc8 deposito)
   deleted: (dron-en dron1 loc8)
   added: (dron-en dron1 deposito)
   goals met: 6 of 11
32. (coger-caja dron1 caja5 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja5) (caja-en caja5 deposito)
   added: (tiene-caja dron1 caja5)
   goals met: 6 of 11
33. (meter dron1 caja5 k1 n0 n1)
   deleted: (tiene-caja dron1 caja5) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja5) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 6 of 11
34. (volar dron1 deposito loc2)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc2)
   goals met: 5 of 11
35. (sacar dron1 caja5 k1 n0 n1)
   deleted: (en-contenedor k1 caja5) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja5)
   goals met: 5 of 11
36. (entregar dron1 caja5 pers2 loc2 medicina)
   deleted: (necesita pers2 medicina) (tiene-caja dron1 caja5)
   added: (tiene pers2 medicina) (dron-sin-caja dron1)
   goals met: 6 of 11
37. (volar dron1 loc2 deposito)
   deleted: (dron-en dron1 loc2)
   added: (dron-en dron1 deposito)
   goals met: 7 of 11
38. (coger-caja dron1 caja6 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja6) (caja-en caja6 deposito)
   added: (tiene-caja dron1 caja6)
   goals met: 7 of 11
39. (meter dron1 caja6 k1 n0 n1)
   deleted: (tiene-caja dron1 caja6) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja6) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 7 of 11
40. (volar dron1 deposito loc4)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc4)
   goals met: 6 of 11
41. (sacar dron1 caja6 k1 n0 n1)
   deleted: (en-contenedor k1 caja6) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja6)
   goals met: 6 of 11
42. (entregar dron1 caja6 pers4 loc4 medicina)
   deleted: (necesita pers4 medicina) (tiene-caja dron1 caja6)
   added: (tiene pers4 medicina) (dron-sin-caja dron1)
   goals met: 7 of 11
43. (volar dron1 loc4 deposito)
   deleted: (dron-en dron1 loc4)
   added: (dron-en dron1 deposito)
   goals met: 8 of 11
44. (coger-caja dron1 caja7 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja7) (caja-en caja7 deposito)
   added: (tiene-caja dron1 caja7)
   goals met: 8 of 11
45. (meter dron1 caja7 k1 n0 n1)
   deleted: (tiene-caja dron1 caja7) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja7) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 8 of 11
46. (volar dron1 deposito loc5)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc5)
   goals met: 7 of 11
47. (sacar dron1 caja7 k1 n0 n1)
   deleted: (en-contenedor k1 caja7) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja7)
   goals met: 7 of 11
48. (entregar dron1 caja7 pers5 loc5 medicina)
   deleted: (necesita pers5 medicina) (tiene-caja dron1 caja7)
   added: (tiene pers5 medicina) (dron-sin-caja dron1)
   goals met: 8 of 11
49. (volar dron1 loc5 deposito)
   deleted: (dron-en dron1 loc5)
   added: (dron-en dron1 deposito)
   goals met: 9 of 11
50. (coger-caja dron1 caja8 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja8) (caja-en caja8 deposito)
   added: (tiene-caja dron1 caja8)
   goals met: 9 of 11
51. (meter dron1 caja8 k1 n0 n1)
   deleted: (tiene-caja dron1 caja8) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja8) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 9 of 11
52. (volar dron1 deposito loc6)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc6)
   goals met: 8 of 11
53. (sacar dron1 caja8 k1 n0 n1)
   deleted: (en-contenedor k1 caja8) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja8)
   goals met: 8 of 11
54. (entregar dron1 caja8 pers6 loc6 medicina)
   deleted: (necesita pers6 medicina) (tiene-caja dron1 caja8)
   added: (tiene pers6 medicina) (dron-sin-caja dron1)
   goals met: 9 of 11
55. (volar dron1 loc6 deposito)
   deleted: (dron-en dron1 loc6)
   added: (dron-en dron1 deposito)
   goals met: 10 of 11
56. (coger-caja dron1 caja9 deposito)
   deleted: (dron-sin-caja dron1) (caja-libre caja9) (caja-en caja9 deposito)
   added: (tiene-caja dron1 caja9)
   goals met: 10 of 11
57. (meter dron1 caja9 k1 n0 n1)
   deleted: (tiene-caja dron1 caja9) (cajas-en-contenedor k1 n0)
   added: (en-contenedor k1 caja9) (dron-sin-caja dron1) (cajas-en-contenedor k1 n1)
   goals met: 10 of 11
58. (volar dron1 deposito loc7)
   deleted: (dron-en dron1 deposito)
   added: (dron-en dron1 loc7)
   goals met: 9 of 11
59. (sacar dron1 caja9 k1 n0 n1)
   deleted: (en-contenedor k1 caja9) (cajas-en-contenedor k1 n1) (dron-sin-caja dron1)
   added: (cajas-en-contenedor k1 n0) (tiene-caja dron1 caja9)
   goals met: 9 of 11
60. (entregar dron1 caja9 pers7 loc7 medicina)
   deleted: (necesita pers7 medicina) (tiene-caja dron1 caja9)
   added: (tiene pers7 medicina) (dron-sin-caja dron1)
   goals met: 10 of 11
61. (volar dron1 loc7 deposito)
   deleted: (dron-en dron1 loc7)
   added: (dron-en dron1 deposito)
   goals met: 11 of 11
